<?php

use Kiyonori\ElasticsearchFluentQueryBuilder\CompareArray;

test(
    '2つの配列を比較し、全く同じであることを意味する「空っぽの配列」が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => 222,
            ],
            new: [
                'a' => 111,
                'b' => 222,
            ],
        );

        expect($result)->toBe([]);
    }
);

test(
    '2つの配列を比較し、差異のある部分が配列として返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => 222,
            ],
            new: [
                'a' => 111,
                'b' => 223, // 👀 ここに注目❗️
            ],
        );

        expect($result)->toBe(
            [
                'b' => 223,
            ]
        );
    }
);

test(
    '2つの配列を比較し、＄new_側の1階層目に欠けているキーがあっても無視され、差分として検知されないこと',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => 222,
            ],
            new: [
                'a' => 111,
                // 'b' => 222, // 👀 ここに注目❗️
            ],
        );

        expect($result)->toBe([]);
    }
);

test(
    '2つの配列を比較し、＄new_側の1階層目に新しいキーがあっても無視され、差分として検知されないこと',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => 222,
            ],
            new: [
                'a' => 111,
                'b' => 222,
                'c' => 333, // 👀 ここに注目❗️
            ],
        );

        expect($result)->toBe([]);
    }
);

test('
    ネストされた配列同士の比較_＄current_と_＄new_の内容がまったく同じである場合、全く同じであることを意味する「空っぽの配列」が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                ],
                'c' => 333,
            ],
            new: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                ],
                'c' => 333,
            ],
        );

        expect($result)->toBe([]);
    }
);

test(
    'ネストされた配列同士の比較_＄current_と_＄new_のうち細部の_key_の並び順が_＄current_側と異なる場合、差分として1階層目の親のキーを含む配列が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                ],
                'c' => 333,
            ],
            new: [
                'a' => 111,
                'b' => [
                    'bb2' => 'か', // 👀 ここに注目❗️
                    'bb1' => 'あ', // 👀 ここに注目❗️
                ],
                'c' => 333,
            ],
        );

        expect($result)->toBe(
            [
                'b' => [
                    'bb2' => 'か',
                    'bb1' => 'あ',
                ],
            ]
        );
    }
);

test(
    'ネストされた配列同士の比較_＄new_側のネストされた_key_項目が_＄current_側と比べて多い場合、差分として1階層目の親のキーを含む配列が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                ],
                'c' => 333,
            ],
            new: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                    'bb3' => 'さ', // 👀 ここに注目❗️
                ],
                'c' => 333,
            ],
        );

        expect($result)->toBe(
            [
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                    'bb3' => 'さ',
                ],
            ]
        );
    }
);

test(
    'ネストされた配列同士の比較_＄new_側のネストされた_key_項目が_＄current_側と比べて少ない場合、差分として1階層目の親のキーを含む配列が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    'bb2' => 'か',
                    'bb3' => 'さ',
                ],
                'c' => 333,
            ],
            new: [
                'a' => 111,
                'b' => [
                    'bb1' => 'あ',
                    // 'bb2' => 'か',// 👀 ここに注目❗️
                    'bb3' => 'さ',
                ],
                'c' => 333,
            ],
        );

        expect($result)->toBe(
            [
                'b' => [
                    'bb1' => 'あ',
                    'bb3' => 'さ',
                ],
            ]
        );
    }
);

test(
    'ネストされた配列同士の比較［］形式の場合にて_＄new_側のネストされた項目が_＄current_側と比べて多い場合、差分として1階層目の親のキーを含む配列が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => [
                    'あいうえお',
                    'アイウエオ',
                ],
                'c' => 333,
            ],
            new: [
                'a' => 111,
                'b' => [
                    'あいうえお',
                    'アイウエオ',
                    'かきくけこ', // 👀 ここに注目❗️
                ],
                'c' => 333,
            ],
        );

        expect($result)->toBe(
            [
                'b' => [
                    'あいうえお',
                    'アイウエオ',
                    'かきくけこ',
                ],
            ]
        );
    }
);

test(
    'ネストされた配列同士の比較_［］形式の場合にて_＄new_側のネストされた項目が_＄current_側と比べて少ない場合、差分として1階層目の親のキーを含む配列が返ってくること',
    function () {
        $result = app(CompareArray::class)->execute(
            current: [
                'a' => 111,
                'b' => [
                    'あいうえお',
                    'アイウエオ',
                ],
                'c' => 333,
            ],
            new: [
                'a' => 111,
                'b' => [
                    // 'あいうえお', // 👀 ここに注目❗️
                    'アイウエオ',
                ],
                'c' => 333,
            ],
        );

        expect($result)->toBe(
            [
                'b' => [
                    'アイウエオ',
                ],
            ]
        );
    }
);
